/*

Подумать над глобальными сущностями. 
К примеру, сущность «Продукт» в интернет-магазине актуальна не только для корзины, но и для каталога. 
Стремиться нужно к тому, чтобы объект «Продукт» имел единую структуру для различных модулей сайта, 
но в разных местах давал возможность вызывать разные методы.

Ну вообще в магазине наверное может быть много сущностей) 

Товар (с признаком каталог ил товар)
Корзина (с товарами)
Заказ (с товарами)
Склад (остатки товаров)
Покупатель (с заказами) 

как то так

*/